[
  {
    "id": 1,
    "correctAnswer": "C",
    "studyGuideTopic": "Threat actors / Motivation",
    "explanation": "The best answer is **Organized crime**. Organized crime groups are profit-driven, often well-resourced, and can be hired or directed (directly or indirectly) to conduct sophisticated attacks. That makes them a plausible proxy for a foreign government seeking capability and deniability.",
    "feedback": {
      "A": "Hacktivists are typically motivated by ideology or a cause, not hired services for targeted state-directed operations.",
      "B": "Whistleblowers expose wrongdoing from inside an organization; they are not generally contracted attackers of foreign critical infrastructure.",
      "C": "Correct. Organized crime groups can act as paid operators, providing capability and deniability for the sponsor.",
      "D": "Unskilled attackers usually lack the expertise to reliably compromise critical systems in other countries."
    }
  },
  {
    "id": 2,
    "correctAnswer": "D",
    "studyGuideTopic": "Cryptography / Hashing",
    "explanation": "**Salting** adds a unique random value to the original data (e.g., a password) before hashing. This increases complexity and helps prevent precomputed attacks (like rainbow tables) by ensuring identical passwords do not produce identical hashes.",
    "feedback": {
      "A": "Key stretching makes password guessing slower by increasing the work factor (many rounds), but it is not the step that adds a unique random value before hashing.",
      "B": "Data masking hides or obfuscates data for viewing/use; it doesn’t strengthen the input to a one-way transformation algorithm.",
      "C": "Steganography hides data inside other data (like images); it’s unrelated to strengthening a hash input.",
      "D": "Correct. Salting adds uniqueness/complexity *before* hashing, which is exactly what the question asks."
    }
  },
  {
    "id": 3,
    "correctAnswer": "D",
    "studyGuideTopic": "Social engineering / Phishing",
    "explanation": "This is **phishing**. The user was lured via email to a link, entered credentials, and then saw an error page—commonly used to reduce suspicion after credential capture.",
    "feedback": {
      "A": "Brand impersonation can be used in phishing, but the defining behavior here is credential capture via a deceptive link and fake login flow.",
      "B": "Pretexting is a fabricated scenario used to persuade a target (often through dialogue). Here the mechanism is an email link to a credential-harvesting page.",
      "C": "Typosquatting is using a lookalike domain name; it may support phishing, but the described attack is phishing itself.",
      "D": "Correct. Phishing is the direct technique used: email lure → fake login → credential capture."
    }
  },
  {
    "id": 4,
    "correctAnswer": "D",
    "studyGuideTopic": "Network security / ACLs / DNS",
    "explanation": "To ensure outbound DNS traffic originates **only** from 10.50.10.25, you must **permit** DNS (port 53) from source **10.50.10.25/32** to any destination, then **deny all** other outbound DNS. Option **D** expresses that logic correctly.",
    "feedback": {
      "A": "This permits DNS from everyone (0.0.0.0/0) and then denies the allowed host—this fails the requirement.",
      "B": "This reverses the source/destination logic; it does not correctly enforce “originates only from 10.50.10.25”.",
      "C": "This again misapplies the matching/deny logic and doesn’t correctly enforce the stated origin constraint.",
      "D": "Correct. Permit source 10.50.10.25/32 to any destination on port 53, then deny all other outbound traffic (or at least all other DNS), matching the requirement."
    }
  },
  {
    "id": 5,
    "correctAnswer": "A",
    "studyGuideTopic": "Identity & Access / Federation / SSO",
    "explanation": "**SSO (Single Sign-On)** allows users to authenticate once using their enterprise identity (domain credentials) and access external services such as SaaS applications through a federated identity flow.",
    "feedback": {
      "A": "Correct. SSO is designed for using existing enterprise credentials to access multiple applications/services, including SaaS.",
      "B": "LEAP is an older EAP method used primarily for certain wireless authentication scenarios; it’s not the standard approach for SaaS access with domain credentials.",
      "C": "MFA strengthens authentication, but it does not by itself provide the cross-application domain-to-SaaS access mechanism.",
      "D": "PEAP is an EAP authentication method (commonly used for Wi‑Fi), not the solution for SaaS access using domain credentials."
    }
  },
  {
    "id": 6,
    "correctAnswer": "A",
    "studyGuideTopic": "Email threats / BEC",
    "explanation": "**Business Email Compromise (BEC)** commonly involves impersonating an executive or trusted party to convince an employee to send money or purchase items (like gift cards). The gift-card request using an executive’s display name is a classic BEC/CEO-fraud scenario.",
    "feedback": {
      "A": "Correct. Executive impersonation to induce fraudulent payment/purchase is a hallmark of BEC.",
      "B": "A ransom message after opening an attachment describes ransomware delivery, not BEC.",
      "C": "Asking for cloud admin credentials is more consistent with spear phishing/credential theft than the payment-redirection pattern of BEC.",
      "D": "A link to a fake login portal is classic phishing, not the fraudulent-payment authorization pattern typical of BEC."
    }
  },
  {
    "id": 7,
    "correctAnswer": "A",
    "studyGuideTopic": "Network segmentation / Administrative access",
    "explanation": "A **jump server** (bastion host) provides a controlled, monitored point of administrative access into a restricted network segment when direct access is not allowed.",
    "feedback": {
      "A": "Correct. A jump server is purpose-built for controlled access into segmented environments.",
      "B": "RADIUS provides AAA services; it doesn’t solve the need for a controlled network access path into the segment.",
      "C": "An HSM protects and manages cryptographic keys; it’s not an access path for DB administrators.",
      "D": "A load balancer distributes traffic and improves availability; it doesn’t provide secure admin access into a restricted segment."
    }
  },
  {
    "id": 8,
    "correctAnswer": "B",
    "studyGuideTopic": "Web security / WAF",
    "explanation": "A **WAF (Web Application Firewall)** inspects and filters HTTP/S traffic and can block malicious payload patterns and exploit attempts targeting web applications. Among the options, a WAF is the best protection layer for a website facing exploitation attempts.",
    "feedback": {
      "A": "An NGFW provides strong network controls, but WAFs are specialized for application-layer (HTTP/S) inspection and web attack patterns.",
      "B": "Correct. A WAF is designed to protect web apps by filtering/blocking malicious web requests and payload signatures.",
      "C": "TLS encrypts traffic in transit; it does not prevent exploitation of the application itself.",
      "D": "SD‑WAN optimizes WAN connectivity; it does not mitigate application-layer exploitation."
    }
  },
  {
    "id": 9,
    "correctAnswer": "A",
    "studyGuideTopic": "Identity & Access / Account protection",
    "explanation": "Suspicious logins suggest credential compromise. **MFA** adds a second factor so stolen passwords alone are not sufficient to authenticate.",
    "feedback": {
      "A": "Correct. MFA directly mitigates the risk of password compromise by requiring an additional factor.",
      "B": "RBAC controls what authenticated users can do, but it doesn’t prevent authentication with stolen passwords.",
      "C": "Network segmentation reduces lateral movement; it doesn’t stop compromised account logins from suspicious IPs.",
      "D": "Antivirus helps detect malware, but it doesn’t address the authentication weakness shown by suspicious logins."
    }
  },
  {
    "id": 10,
    "correctAnswer": "B",
    "studyGuideTopic": "Credential attacks",
    "explanation": "Finding a plaintext password in a configuration file indicates credentials have been exposed and can be collected—this aligns with **credential harvesting** (acquiring credentials from systems, files, or users).",
    "feedback": {
      "A": "Rainbow tables are used to crack hashed passwords, not plaintext passwords already revealed in a file.",
      "B": "Correct. Credential harvesting is collecting credentials from sources like config files, memory, or phishing pages.",
      "C": "Brute force is guessing passwords; no guessing is needed when plaintext credentials are found.",
      "D": "Default credentials are vendor defaults; the question describes plaintext storage, not necessarily a default value."
    }
  },
  {
    "id": 11,
    "correctAnswer": "C",
    "studyGuideTopic": "Mobile security / Encryption at rest",
    "explanation": "**Full disk encryption (FDE)** is best for securing data stored on mobile devices because it protects the entire drive (OS, apps, and user data) if the device is lost or stolen.",
    "feedback": {
      "A": "File encryption can protect specific files, but it’s easier to misconfigure and may leave metadata/other data exposed compared to device-wide protection.",
      "B": "Folder encryption is scoped and can miss data stored elsewhere on the device.",
      "C": "Correct. Full disk encryption protects data at rest broadly across the device storage, which is the goal here.",
      "D": "Database encryption is limited to databases and doesn’t address the overall mobile device storage exposure."
    }
  },
  {
    "id": 12,
    "correctAnswer": "B",
    "studyGuideTopic": "Endpoint security / Monitoring",
    "explanation": "**EDR (Endpoint Detection and Response)** is best for detecting suspicious behavior like unauthorized software installation by insiders because it monitors endpoint activities, process execution, and provides response/containment features.",
    "feedback": {
      "A": "VPN logs show remote access patterns; they won’t reliably detect local unauthorized software installs.",
      "B": "Correct. EDR monitors endpoint behavior/processes and is well-suited to detect unauthorized installs and insider activity.",
      "C": "File server logs capture file access on servers, not local software installation events on user endpoints.",
      "D": "Antivirus may detect known malware, but unauthorized software isn’t always malicious and can evade traditional signature-based detection."
    }
  },
  {
    "id": 13,
    "correctAnswer": "C",
    "studyGuideTopic": "Malware types",
    "explanation": "Slow performance and persistent pop-ups are common symptoms of **spyware/adware** behavior, which often tracks user activity and injects unwanted advertisements.",
    "feedback": {
      "A": "Worms primarily self-replicate and spread across networks; pop-ups are not their hallmark symptom.",
      "B": "Trojans masquerade as legitimate software; symptoms vary and pop-ups aren’t the defining indicator here.",
      "C": "Correct. Spyware/adware commonly causes pop-ups and performance degradation by tracking and injecting content.",
      "D": "Ransomware typically encrypts files and displays a ransom demand; it’s not mainly “pop-ups and slowness.”"
    }
  },
  {
    "id": 14,
    "correctAnswer": "A",
    "studyGuideTopic": "Testing / Recovery validation",
    "explanation": "**Regression testing** verifies that systems and applications function correctly after changes—such as malware removal—ensuring normal operations were restored and the cleanup didn’t break existing functionality.",
    "feedback": {
      "A": "Correct. Regression testing is used to confirm expected behavior still works after remediation/changes.",
      "B": "User acceptance testing confirms the solution meets user/business requirements; it’s not the standard post-remediation validation step for malware cleanup.",
      "C": "Chaos engineering intentionally introduces failures to test resilience; unrelated to confirming normal function after malware removal.",
      "D": "Dynamic analysis is used to study malware behavior during execution; it’s not a post-removal “back to normal” validation method."
    }
  },
  {
    "id": 15,
    "correctAnswer": "A",
    "studyGuideTopic": "Controls / IDS",
    "explanation": "An **IDS (Intrusion Detection System)** is a **detective** control: it identifies and alerts on suspicious activity rather than actively blocking it (that would be more like IPS).",
    "feedback": {
      "A": "Correct. IDS monitors and alerts—detective control.",
      "B": "Preventive controls stop actions from occurring (e.g., firewall rules); IDS generally detects rather than prevents.",
      "C": "Corrective controls fix issues after detection (e.g., restoring from backup).",
      "D": "Compensating controls are alternate safeguards used when the primary control can’t be applied; IDS is not inherently compensating."
    }
  },
  {
    "id": 16,
    "correctAnswer": "A",
    "studyGuideTopic": "Device trust / Attestation",
    "explanation": "**Hardware attestation** can prove to a service that a device is known/trusted and meets requirements (e.g., secure boot/TPM measurements). This helps ensure an application is allowed to run only on approved devices.",
    "feedback": {
      "A": "Correct. Attestation validates device identity/state (often via TPM) and can be used to restrict execution/access to approved devices.",
      "B": "Virtualization abstracts hardware and runs VMs/containers; it doesn’t inherently restrict an app to specific physical devices.",
      "C": "RADIUS is AAA for network access; it doesn’t enforce “run only on specific devices” for an application.",
      "D": "Federation links identities across domains/orgs; it’s not a device-binding control."
    }
  },
  {
    "id": 17,
    "correctAnswer": "B",
    "studyGuideTopic": "Email security / Secure email gateway",
    "explanation": "A **secure email gateway** (often cloud-delivered) is purpose-built to filter spam, malware, malicious links, and enforce email security policies—making it the correct solution for outsourced email filtering.",
    "feedback": {
      "A": "CASB controls access and security policies for cloud apps; it’s not the dedicated control for email filtering.",
      "B": "Correct. Secure email gateways provide anti-spam, anti-phishing, attachment/link inspection, and policy controls for email.",
      "C": "A jump host is for administrative access into segmented networks; unrelated to email filtering.",
      "D": "SOAR automates security workflows; it can orchestrate responses but it isn’t the filtering control itself."
    }
  },
  {
    "id": 18,
    "correctAnswer": "C",
    "studyGuideTopic": "Data protection / Theft scenarios",
    "explanation": "If laptops are stolen, **full disk encryption** prevents attackers from reading the data at rest without the decryption key, significantly reducing data exposure risk.",
    "feedback": {
      "A": "Cloud backups help recover data, but they don’t prevent an attacker from accessing local data on a stolen laptop.",
      "B": "Certificate pinning protects against MITM attacks for app connections; unrelated to theft of stored data.",
      "C": "Correct. Full disk encryption protects data at rest on the device if it’s stolen.",
      "D": "Containerization can isolate corporate data in a managed container, but it’s not as comprehensive as full disk encryption for the whole device’s storage."
    }
  },
  {
    "id": 19,
    "correctAnswer": "C",
    "studyGuideTopic": "Governance / Baselines",
    "explanation": "A **security baseline** is a standardized minimum set of security configurations for systems. **Hardening templates** define those minimum secure settings (services, policies, permissions, configuration values).",
    "feedback": {
      "A": "Firewall rule sets are important controls, but they represent a specific device configuration rather than a general baseline template for system hardening.",
      "B": "Patch schedules are a maintenance process; they support security but aren’t typically what’s meant by a baseline configuration standard.",
      "C": "Correct. Hardening templates provide standardized minimum secure configuration—this matches the definition of a baseline.",
      "D": "Change requests are part of change management; they document changes rather than define minimum secure configuration."
    }
  },
  {
    "id": 20,
    "correctAnswer": "B",
    "studyGuideTopic": "Incident handling / Process",
    "explanation": "**Incident response** provides a structured, repeatable approach to detecting, analyzing, containing, eradicating, and recovering from security events.",
    "feedback": {
      "A": "Risk management identifies and treats risks, but it’s not the operational process for handling live security events.",
      "B": "Correct. Incident response defines roles, steps, escalation paths, and actions for security events.",
      "C": "Vulnerability scanning finds weaknesses; it doesn’t provide the full structured process for managing an incident.",
      "D": "Penetration testing is proactive testing; it’s not the response framework for real events."
    }
  },
  {
    "id": 21,
    "correctAnswer": "B",
    "studyGuideTopic": "Security principles / CIA",
    "explanation": "If an attacker **modified logs**, the trustworthiness of that data has been altered. That is a violation of **integrity**—ensuring data remains accurate and unmodified.",
    "feedback": {
      "A": "Confidentiality is preventing unauthorized disclosure; log modification is not primarily about disclosure.",
      "B": "Correct. Integrity is about preventing unauthorized modification; changing logs directly violates integrity.",
      "C": "Availability is ensuring access and uptime; log tampering doesn’t necessarily impact availability.",
      "D": "Non-repudiation focuses on preventing denial of actions (often via signatures/audit trails). Tampering with logs primarily breaks integrity, even though it can also undermine non-repudiation."
    }
  },
  {
    "id": 22,
    "correctAnswer": "B",
    "studyGuideTopic": "Network architecture / Partner access",
    "explanation": "A **perimeter network (DMZ)** is the most secure option listed for exposing services to an external business partner because it isolates externally reachable services from the internal network while enabling controlled access and monitoring.",
    "feedback": {
      "A": "A bastion host is typically used for administrative access into protected environments; it’s not the general-purpose pattern for exposing partner-facing services.",
      "B": "Correct. A perimeter network (DMZ) is designed to host externally accessible services while isolating the internal network.",
      "C": "A WAF protects web applications, but it doesn’t provide the network segmentation and isolation that a DMZ provides for exposed services overall.",
      "D": "SSO handles authentication; it doesn’t create a secure network exposure architecture."
    }
  },
  {
    "id": 23,
    "correctAnswer": "D",
    "studyGuideTopic": "Logging / Endpoint telemetry",
    "explanation": "If you need more detail about an **executable running on a laptop**, **endpoint logs** (EDR/Sysmon/OS event logs) provide process execution details, parent/child processes, hashes, command-line args, and user context.",
    "feedback": {
      "A": "Application logs are generated by specific applications and may not capture low-level process execution context for unknown executables.",
      "B": "IDS/IPS logs focus on network detections/signatures; they won’t show full local process execution details.",
      "C": "Network logs show connections/flows; useful, but they don’t provide the richest detail about the local executable itself.",
      "D": "Correct. Endpoint logs capture process and host-level telemetry needed to investigate the running executable."
    }
  },
  {
    "id": 24,
    "correctAnswer": "D",
    "studyGuideTopic": "Detection engineering / Threat hunting",
    "explanation": "When attackers use a new tactic not yet covered by existing SIEM detections, the analyst should perform **threat hunting**—proactively searching for indicators/behaviors across systems and building new detections from findings.",
    "feedback": {
      "A": "Digital forensics is typically deeper post-incident investigation (evidence handling/analysis), not the primary proactive approach for unknown tactics.",
      "B": "E‑discovery is a legal/regulatory process for collecting information, not a security detection activity.",
      "C": "Incident response is the broader process once an incident is identified; the prompt indicates a detection gap that calls for proactive hunting.",
      "D": "Correct. Threat hunting is specifically aimed at finding unknown/undetected tactics and improving detection coverage."
    }
  },
  {
    "id": 25,
    "correctAnswer": "B",
    "studyGuideTopic": "Risk management / Treatment strategies",
    "explanation": "Purchasing **cyber insurance** shifts financial impact to another party. That is **risk transfer**.",
    "feedback": {
      "A": "Accepting risk means taking no action and acknowledging potential impact; buying insurance is taking action.",
      "B": "Correct. Transferring risk shifts financial loss to an insurer/third party—this is exactly what cyber insurance does.",
      "C": "Mitigating risk reduces likelihood/impact through controls; insurance doesn’t reduce the event likelihood, it reduces financial exposure.",
      "D": "Avoiding risk eliminates the activity that creates the risk; insurance does not eliminate the underlying activity."
    }
  },
  {
    "id": 26,
    "correctAnswer": "C",
    "studyGuideTopic": "Encryption at rest / Endpoint protection",
    "explanation": "The correct answer is **C. Full disk encryption (FDE)**. FDE encrypts the entire drive (including OS files, user files, temp space, and swap), so if a laptop is lost or stolen, the data remains unreadable without the decryption key. This is the standard control for protecting **data at rest** on portable endpoints.",
    "feedback": {
      "A": "Partition encryption protects only a portion of the disk; sensitive data can still leak through unencrypted areas (swap, temp files, system folders).",
      "B": "Asymmetric encryption describes a *type of encryption* (public/private keys), not a practical whole-laptop protection technique by itself.",
      "C": "Correct. Full disk encryption protects all data at rest on the laptop, reducing loss/theft impact.",
      "D": "Database encryption is useful for protecting database files, but laptops typically contain many other sensitive files outside a database."
    }
  },
  {
    "id": 27,
    "correctAnswer": "D",
    "studyGuideTopic": "Policies / Administrative controls",
    "explanation": "The correct answer is **D. Preventive**. An acceptable use policy (AUP) is an administrative control that **directs user behavior** and helps prevent misuse by clearly defining what is allowed and prohibited. While policies can also have deterrent effects, among the listed categories the best fit is preventive.",
    "feedback": {
      "A": "Detective controls identify or discover events after they occur (e.g., logs, IDS). An AUP is not primarily a detection mechanism.",
      "B": "Compensating controls are alternate controls used when a primary control cannot be implemented; an AUP is not a compensating control by default.",
      "C": "Corrective controls fix issues after they happen (e.g., restore from backup, patching). An AUP is not corrective.",
      "D": "Correct. AUPs set expectations and restrictions up front to reduce the likelihood of misuse."
    }
  },
  {
    "id": 28,
    "correctAnswer": "D",
    "studyGuideTopic": "Access control / Least privilege",
    "explanation": "The correct answer is **D. Least privilege**. Restricting the admin console so only the IT manager and help desk lead can access it ensures only those who **need** administrative capabilities receive them, reducing misuse and limiting blast radius if an account is compromised.",
    "feedback": {
      "A": "Hardening is the process of reducing attack surface (removing services, patching, secure configs). The scenario is about limiting access rights.",
      "B": "Employee monitoring focuses on observing user actions (screen capture, logs, DLP, etc.) rather than restricting privileges.",
      "C": "Configuration enforcement ensures systems remain in a desired state (baselines, policies). The scenario is specifically about access rights.",
      "D": "Correct. Granting admin console access only to necessary personnel is least privilege."
    }
  },
  {
    "id": 29,
    "correctAnswer": "C",
    "studyGuideTopic": "Risk management / Risk register",
    "explanation": "The correct answer is **C. Risk register**. A risk register is the central document that tracks identified risks, owners (responsible parties), likelihood/impact, status, and often risk ratings and thresholds that trigger escalation or treatment actions.",
    "feedback": {
      "A": "Risk tolerance is the amount of risk an organization is willing to accept; it does not list individual risks and owners.",
      "B": "Risk transfer is a treatment option (e.g., insurance, outsourcing) and is not the document used to track risks and ownership.",
      "C": "Correct. A risk register documents risks, assigned owners, and decision thresholds/status.",
      "D": "Risk analysis is the process of evaluating risk likelihood/impact; it feeds the register but is not itself the tracking artifact."
    }
  },
  {
    "id": 30,
    "correctAnswer": "D",
    "studyGuideTopic": "Change control / Network security management",
    "explanation": "The correct answer is **D. Change management procedure**. Firewall rule changes can cause outages or security exposures, so they should follow change control: request, review/approval, testing (when possible), implementation plan, and rollback plan.",
    "feedback": {
      "A": "A disaster recovery plan focuses on restoring IT services after a major disruption, not routine firewall rule updates.",
      "B": "Incident response procedures guide actions during/after a security incident, not standard firewall rule lifecycle changes.",
      "C": "Business continuity plans focus on maintaining critical business functions during disruption, not normal firewall rule changes.",
      "D": "Correct. Change management helps ensure firewall rules are reviewed, tested, approved, and implemented safely."
    }
  },
  {
    "id": 31,
    "correctAnswer": "B",
    "studyGuideTopic": "Vulnerability management / Bug bounty programs",
    "explanation": "The correct answer is **B. Bug bounty**. A bug bounty program rewards external researchers for responsibly reporting vulnerabilities, expanding the organization's testing coverage and improving visibility into real-world weaknesses.",
    "feedback": {
      "A": "Compliance testing validates adherence to standards/regulations; it does not typically pay external researchers for vulnerability discovery.",
      "B": "Correct. Bug bounty programs pay for valid vulnerability reports under defined rules.",
      "C": "Vendor assessments evaluate third-party risk; they are not reward programs for finding vulnerabilities.",
      "D": "Security audits assess controls and evidence against a framework; they are not the same as paying individuals for vulnerability discovery."
    }
  },
  {
    "id": 32,
    "correctAnswer": "D",
    "studyGuideTopic": "Penetration testing / Rules of engagement",
    "explanation": "The correct answer is **D. SOW (Statement of Work)**. For penetration tests, the SOW typically defines scope, responsibilities, deliverables, timelines, and rules of engagement so both sides understand what will be tested and how.",
    "feedback": {
      "A": "An SLA defines service performance targets (uptime, response time) for ongoing services; it is not the primary pre-test agreement for scope and responsibilities.",
      "B": "An NDA is commonly used for confidentiality, but it does not define test scope, responsibilities, and deliverables as the main agreement.",
      "C": "An MOU is a general agreement of understanding; it is less specific than an SOW for detailing scope and deliverables for a pentest.",
      "D": "Correct. The SOW outlines scope, responsibilities, constraints, and expected deliverables for the penetration test."
    }
  },
  {
    "id": 33,
    "correctAnswer": "C",
    "studyGuideTopic": "IoT security / Compensating controls",
    "explanation": "The correct answer is **C. Segmentation**. Legacy IoT devices often cannot be patched quickly (or at all). Network segmentation isolates vulnerable devices into restricted VLANs/subnets with tight firewall rules, limiting exposure and reducing the chance a compromise spreads.",
    "feedback": {
      "A": "Insurance transfers financial risk; it does not reduce the technical exposure of an unpatched IoT vulnerability.",
      "B": "Patching is ideal when available, but the scenario focuses on *legacy* IoT where patches may not exist or cannot be deployed quickly.",
      "C": "Correct. Segmentation is a fast, practical mitigation when patching is not feasible.",
      "D": "Replacement may be the long-term fix, but it usually takes procurement time and operational planning, so it is not the quickest mitigation."
    }
  },
  {
    "id": 34,
    "correctAnswer": "A",
    "studyGuideTopic": "Data protection / Exfiltration monitoring",
    "explanation": "The correct answer is **A. Data exfiltration**. Unexpected outbound traffic from a server often indicates data being moved out of the environment (sometimes slowly to avoid detection). Analysts commonly investigate whether sensitive data is being exfiltrated via HTTP/S, DNS tunneling, SFTP, or other channels.",
    "feedback": {
      "A": "Correct. Unusual outbound traffic is a strong indicator of possible data exfiltration.",
      "B": "A DoS attack typically produces *inbound* traffic floods or service unavailability; it is less associated with unexpected outbound transfers.",
      "C": "Local malware could be the root cause, but the observed symptom (unexpected outbound traffic leaving the server) most directly points to exfiltration behavior.",
      "D": "Shadow IT is unauthorized systems/services used by employees; it doesn’t specifically explain unexpected outbound traffic from a server."
    }
  },
  {
    "id": 35,
    "correctAnswer": "C",
    "studyGuideTopic": "Physical security / Tamper resistance",
    "explanation": "The correct answer is **C. Tamper-resistant hardware**. ATM skimmers physically intercept card data at the point of swipe/insert. Using tamper-resistant/tamper-evident components, secure card readers, and anti-skimming hardware makes it significantly harder to attach skimmers or capture magnetic stripe/chip data.",
    "feedback": {
      "A": "CCTV can help identify suspects after the fact (detective), but it does not directly prevent skimmers from capturing card data.",
      "B": "Access logs record entry and activity, but they do not physically stop skimming devices from being installed or reading cards.",
      "C": "Correct. Tamper-resistant/anti-skimming hardware directly prevents or disrupts skimmer installation and data capture.",
      "D": "Security guards may deter some activity, but they are not as direct or reliable as anti-skimming/tamper-resistant controls at the device."
    }
  },
  {
    "id": 36,
    "correctAnswer": "A",
    "studyGuideTopic": "Virtualization / Standardized images",
    "explanation": "The correct answer is **A. Golden images**. Golden images are standardized, hardened VM images (OS + required configurations/tools) that engineers can deploy quickly to ensure consistency, reduce configuration drift, and speed provisioning.",
    "feedback": {
      "A": "Correct. Golden images enable fast, consistent VM deployments with approved configurations.",
      "B": "Snapshots are point-in-time captures of a VM state; they are useful for rollback, not for standardizing new deployments.",
      "C": "Cloning copies an existing VM, but it can propagate misconfigurations or drift unless carefully managed; golden images are the controlled standard.",
      "D": "Baseline templates can help, but “golden image” is the clearest, most standard term for consistent VM provisioning in this context."
    }
  },
  {
    "id": 37,
    "correctAnswer": "B",
    "studyGuideTopic": "Software vulnerabilities / Memory safety",
    "explanation": "The correct answer is **B. Buffer overflow**. Buffer overflows occur when software writes more data to a buffer than it can hold, corrupting adjacent memory. This can cause crashes (memory corruption) and may be exploitable for code execution.",
    "feedback": {
      "A": "SQL injection targets database queries via untrusted input; it does not typically cause server crashes from memory corruption.",
      "B": "Correct. Buffer overflows can corrupt memory and crash systems (and may allow exploitation).",
      "C": "Cross-site scripting (XSS) targets browsers and web apps by injecting scripts; it is not primarily a memory corruption crash issue on a server.",
      "D": "A logic flaw is an error in business logic or workflow; it is not specifically characterized by memory corruption."
    }
  },
  {
    "id": 38,
    "correctAnswer": "B",
    "studyGuideTopic": "Asset management / Network discovery",
    "explanation": "The correct answer is **B. Asset inventory**. Asset inventory (often supported by discovery scans and CMDB processes) helps identify what devices are authorized and detect unknown/unauthorized devices that appear on the network.",
    "feedback": {
      "A": "NetFlow provides traffic flow metadata; it can hint at unknown devices, but it’s not the primary control for *discovering and reconciling* unauthorized assets.",
      "B": "Correct. An asset inventory (with discovery) is used to identify and track authorized devices and spot unauthorized ones.",
      "C": "A SIEM correlates logs and alerts; it depends on data sources and is not the primary tool for discovering devices on a network.",
      "D": "Firewall logs show traffic allowed/blocked at the firewall; they may not reveal all internal unauthorized devices."
    }
  },
  {
    "id": 39,
    "correctAnswer": "B",
    "studyGuideTopic": "Wireless attacks / Evil twin",
    "explanation": "The correct answer is **B. Evil twin**. An evil twin is a **malicious access point** that impersonates a legitimate SSID to trick users into connecting, enabling interception or manipulation of traffic.",
    "feedback": {
      "A": "A rogue AP is an unauthorized access point, but an evil twin specifically *mimics a legitimate AP/SSID* to lure victims.",
      "B": "Correct. An evil twin is a fake AP that clones a legitimate network identity to intercept user traffic.",
      "C": "Packet sniffing is the act of capturing traffic; it can be a technique used after users connect, but it is not the name of the fake-AP attack itself.",
      "D": "MAC spoofing changes a device’s MAC address; it can be used in wireless attacks but it does not describe the fake AP impersonation."
    }
  },
  {
    "id": 40,
    "correctAnswer": "B",
    "studyGuideTopic": "Network attacks / ARP poisoning",
    "explanation": "The correct answer is **B. ARP spoofing**. By poisoning/altering ARP tables, an attacker can redirect traffic to themselves (man-in-the-middle), causing interception or disruption.",
    "feedback": {
      "A": "DNS poisoning corrupts DNS resolution to redirect domain lookups; ARP table manipulation is different.",
      "B": "Correct. ARP spoofing (ARP poisoning) manipulates ARP caches/tables to redirect traffic.",
      "C": "A smurf attack is an ICMP amplification DoS technique; it does not involve ARP table changes.",
      "D": "On-path attack describes the result (attacker in the middle), but the specific technique here is ARP spoofing."
    }
  },
  {
    "id": 41,
    "correctAnswer": "B",
    "studyGuideTopic": "Security automation / SOAR",
    "explanation": "The correct answer is **B. Orchestration**. SOAR platforms coordinate tools and actions across systems (EDR, email gateways, firewalls) to automate responses such as isolating endpoints, blocking hashes, or opening tickets.",
    "feedback": {
      "A": "Aggregation is collecting data from multiple sources; SOAR does this, but the question is about automatic response actions.",
      "B": "Correct. Orchestration coordinates automated actions across tools to respond to alerts.",
      "C": "Enrichment adds context to alerts (WHOIS, threat intel); it supports decisions but is not the action automation itself.",
      "D": "Filtering reduces noise by excluding events; it’s not the capability described by automated response."
    }
  },
  {
    "id": 42,
    "correctAnswer": "B",
    "studyGuideTopic": "Hardening / Attack surface reduction",
    "explanation": "The correct answer is **B. Remove unnecessary services**. Attack surface is reduced by disabling/removing unused services, ports, accounts, and features. Fewer exposed services means fewer potential vulnerabilities for attackers to exploit.",
    "feedback": {
      "A": "A HIDS can detect suspicious activity, but it does not directly reduce the exposed attack surface of the server.",
      "B": "Correct. Removing unnecessary services reduces exposed code paths and listening ports, lowering attack surface.",
      "C": "Encryption protects data confidentiality, but it does not necessarily reduce the number of exposed services on a public web server.",
      "D": "MFA protects authentication, but a web server can still be attacked via vulnerable services; removing unnecessary services is a direct hardening step."
    }
  },
  {
    "id": 43,
    "correctAnswer": "C",
    "studyGuideTopic": "Patch management / Change control",
    "explanation": "The correct answer is **C. Create a change control request**. Even high-priority patches in production should follow an emergency/expedited change process that documents risk, approvals, testing plans (when possible), implementation windows, and rollback steps.",
    "feedback": {
      "A": "Air-gapping is an extreme isolation measure and is not a normal prerequisite to applying a patch.",
      "B": "Moving network segments may reduce exposure, but it is not the standard first step; the key governance control is change management.",
      "C": "Correct. A change control request (including emergency change) ensures approval, documentation, and rollback planning.",
      "D": "Applying a patch immediately without change control increases outage risk and can violate governance requirements."
    }
  },
  {
    "id": 44,
    "correctAnswer": "D",
    "studyGuideTopic": "Incident response / Lessons learned",
    "explanation": "The correct answer is **D. To prevent future similar incidents**. Root-cause analysis identifies what actually enabled the incident (technical weakness, process gap, misconfiguration), allowing remediation that reduces the chance of recurrence.",
    "feedback": {
      "A": "Indicators of compromise (IoCs) are gathered during detection/analysis, but root-cause analysis is focused on *why* the incident occurred.",
      "B": "Identifying affected systems is part of scoping and containment; root-cause analysis goes deeper into underlying causes.",
      "C": "Eradicating malware is a response activity, but root-cause analysis is performed to understand and eliminate the underlying conditions that allowed it.",
      "D": "Correct. RCA supports long-term remediation and prevention of repeat incidents."
    }
  },
  {
    "id": 45,
    "correctAnswer": "B",
    "studyGuideTopic": "Governance / Compliance (PCI DSS)",
    "explanation": "The correct answer is **B. Audit findings**. An internal PCI DSS assessment failure typically results in documented findings, a remediation plan, and follow-up validation. Fines usually happen after external enforcement by card brands/acquirers when noncompliance is confirmed and/or breaches occur.",
    "feedback": {
      "A": "Fines are possible, but they are more commonly associated with external enforcement or ongoing noncompliance, not the immediate outcome of an internal assessment.",
      "B": "Correct. Internal assessments most often produce audit findings and required remediation actions.",
      "C": "Sanctions are not a standard PCI DSS outcome term; PCI enforcement is usually contractual via acquirers and card brands.",
      "D": "Reputation damage can occur if issues become public (especially after a breach), but an internal assessment failure most directly produces findings/remediation."
    }
  },
  {
    "id": 46,
    "correctAnswer": "A",
    "studyGuideTopic": "Business continuity / Capacity planning & BIA inputs",
    "explanation": "The correct answer is **A. Capacity planning**. Determining the minimum number of personnel (and other resources) required to keep critical operations running during a disruption is part of capacity planning and often informed by a business impact analysis (BIA).",
    "feedback": {
      "A": "Correct. Identifying the staff/resources needed to operate during disruption is capacity planning (often driven by BIA requirements).",
      "B": "Redundancy is providing duplicates (systems, links, staff) to avoid single points of failure; it is not the planning step of determining required staffing levels.",
      "C": "Geographic dispersion refers to spreading resources across locations to reduce regional risk; it doesn’t specifically mean calculating required staffing.",
      "D": "A tabletop exercise is a discussion-based test of plans; it comes after planning, not during resource requirement determination."
    }
  },
  {
    "id": 47,
    "correctAnswer": "C",
    "studyGuideTopic": "Data protection / Geo-blocking",
    "explanation": "The correct answer is **C. Geolocation policy**. Geolocation-based access controls (geo-blocking/geo-fencing) can restrict access to documents or services based on source country/region to reduce exposure from high-risk locations.",
    "feedback": {
      "A": "Data masking obfuscates data values but does not prevent access from specific countries.",
      "B": "Encryption protects confidentiality; it does not stop a user in a high-risk country from accessing documents if they are authorized and have keys.",
      "C": "Correct. A geolocation policy can restrict access by country/region to reduce risk.",
      "D": "Data sovereignty refers to legal/regulatory requirements about where data is stored/processed; it is not the control for blocking access by geography."
    }
  },
  {
    "id": 48,
    "correctAnswer": "A",
    "studyGuideTopic": "Hardware/firmware security",
    "explanation": "The correct answer is **A. Firmware version**. Firmware issues are closely tied to specific hardware platforms; outdated or vulnerable firmware (BIOS/UEFI/device firmware) can introduce hardware-specific security risks.",
    "feedback": {
      "A": "Correct. Firmware vulnerabilities are hardware/firmware specific and often require vendor firmware updates.",
      "B": "Buffer overflow is a software coding vulnerability (memory handling) and is not hardware-specific.",
      "C": "SQL injection is a web/database input validation issue, not hardware-specific.",
      "D": "Cross-site scripting is a web application/browser vulnerability, not hardware-specific."
    }
  },
  {
    "id": 49,
    "correctAnswer": "B",
    "studyGuideTopic": "Change management / Testing changes",
    "explanation": "The correct answer is **B. Testing the rule in a non-production environment**. ACL/firewall rule changes can have broad impact; testing in a staging environment (or using a controlled rollout) helps catch mistakes like overly broad deny rules before production is affected.",
    "feedback": {
      "A": "Documentation in a change request is important, but it would not by itself prevent the outage if the rule was still implemented incorrectly.",
      "B": "Correct. Testing in a non-production environment would likely have revealed the connectivity break before the production rollout.",
      "C": "Disabling IPS signatures is unrelated to ACL rule ordering and reachability.",
      "D": "Adding 'allow any' above a deny-any defeats the security purpose of a deny-any baseline and is not a sound prevention method."
    }
  },
  {
    "id": 50,
    "correctAnswer": "C",
    "studyGuideTopic": "Disaster recovery / Site types (hot/warm/cold)",
    "explanation": "The correct answer is **C. Cold site**. Cold sites are the lowest-cost option and typically require the most time to restore operations because they provide space and basic utilities but little to no running infrastructure. An RTO/RPO of **two days** aligns well with a cold site.",
    "feedback": {
      "A": "Real-time recovery implies near-zero downtime and data loss, which is far more expensive than the scenario describes.",
      "B": "Hot sites provide near-immediate capability with active systems—high cost and typically much lower RTO/RPO than two days.",
      "C": "Correct. Cold sites are low cost and support longer RTO/RPO windows (days).",
      "D": "Warm sites provide some infrastructure and faster recovery than cold sites; they cost more and are often used when RTO/RPO are shorter than multiple days."
    }
  },
  {
    "id": 51,
    "correctAnswer": "B",
    "studyGuideTopic": "Media sanitization / Data disposal",
    "explanation": "The correct answer is **B. Sanitization**. Secure wiping is a form of media sanitization—removing data from storage media so it cannot be recovered before reuse, resale, or recycling.",
    "feedback": {
      "A": "Enumeration is discovering systems/services/users; it is unrelated to securely wiping data from drives.",
      "B": "Correct. Sanitization (e.g., secure erase, overwrite, crypto-erase) ensures data cannot be recovered before disposal/recycling.",
      "C": "Destruction is physically destroying the drive (shredding, degaussing, pulverizing). Wiping is sanitization, not necessarily destruction.",
      "D": "Inventory is tracking assets; it does not describe a secure data wiping requirement."
    }
  },
  {
    "id": 52,
    "correctAnswer": "C",
    "studyGuideTopic": "Data classification / PHI protection",
    "explanation": "The correct answer is **C. Sensitive**. Patient data (PHI/PII) requires strong confidentiality controls and is typically classified as sensitive to ensure encryption, access controls, and auditing are applied.",
    "feedback": {
      "A": "Private is sometimes used as a label, but \"sensitive\" best matches regulated patient data requiring heightened controls.",
      "B": "Critical usually refers to system importance/availability. Patient data is important, but the question is about classification for protection.",
      "C": "Correct. Patient records are sensitive information (PHI/PII) requiring restricted access and strong protections.",
      "D": "Public data is intended for broad distribution; patient data must not be public."
    }
  },
  {
    "id": 53,
    "correctAnswer": "A",
    "studyGuideTopic": "Data sovereignty / Privacy & compliance",
    "explanation": "The correct answer is **A. Local data protection regulations**. Hosting data in other countries introduces legal and regulatory requirements (privacy laws, breach notification rules, cross-border transfer restrictions) that must be addressed first.",
    "feedback": {
      "A": "Correct. Data residency/sovereignty and local privacy regulations determine what you can store/process and how.",
      "B": "Threat levels vary by region, but compliance requirements can be absolute blockers even before security design.",
      "C": "Contracts matter, but regulatory compliance (and legal authority over data) is the first concern for foreign data centers.",
      "D": "Time-zone differences are operational considerations, not the primary gating factor for international data centers."
    }
  },
  {
    "id": 54,
    "correctAnswer": "B",
    "studyGuideTopic": "Application control / Allow listing",
    "explanation": "The correct answer is **B. Application allow list**. Allow listing blocks unknown or unauthorized programs by permitting only approved applications to run (often used on servers, kiosks, and high-security endpoints).",
    "feedback": {
      "A": "ACLs control access to files/objects and network resources, but they do not reliably prevent unknown executables from running.",
      "B": "Correct. Allow listing permits only approved software, effectively blocking unknown programs.",
      "C": "A host-based firewall controls network traffic, not whether an application can execute.",
      "D": "DLP focuses on preventing data loss/exfiltration, not stopping unknown applications from launching."
    }
  },
  {
    "id": 55,
    "correctAnswer": "D",
    "studyGuideTopic": "Offensive security / Penetration testing",
    "explanation": "The correct answer is **D. Red team**. Red teams emulate adversaries using tactics like penetration testing and social engineering to test defenses and detection/response capabilities.",
    "feedback": {
      "A": "White team typically oversees rules, scope, and safety—more common in exercises—rather than conducting the attacks.",
      "B": "Purple team is a collaboration model between red and blue to improve detection; it’s not the primary offensive team.",
      "C": "Blue team is the defensive team responsible for monitoring, detection, and response.",
      "D": "Correct. Red teams perform offensive testing including pentesting and social engineering."
    }
  },
  {
    "id": 56,
    "correctAnswer": "B",
    "studyGuideTopic": "Software integrity / Supply chain controls",
    "explanation": "The correct answer is **B. Code signing**. Code signing uses digital signatures to prove software came from the organization and was not altered, providing authenticity and integrity to users and systems.",
    "feedback": {
      "A": "Input validation prevents injection and data handling issues, but it does not prove software authenticity.",
      "B": "Correct. Code signing validates the publisher and detects tampering of the software package.",
      "C": "Static analysis finds code defects and vulnerabilities, but it does not provide authenticity to released binaries.",
      "D": "Secure cookies protect web sessions; they are unrelated to validating software authenticity."
    }
  },
  {
    "id": 57,
    "correctAnswer": "A",
    "studyGuideTopic": "Deception technology / Honeypots",
    "explanation": "The correct answer is **A. Honeypot**. Honeypots are decoy systems designed to attract attackers and observe their behavior, providing detection and intelligence without risking production systems.",
    "feedback": {
      "A": "Correct. Honeypots detect and study attacker actions using decoy resources isolated from production.",
      "B": "Video surveillance is physical security monitoring, not a technical tool for observing attacker activity on systems.",
      "C": "Zero Trust is an architecture model (verify explicitly, least privilege), not a specific decoy/detection system.",
      "D": "Geofencing restricts access by geography; it doesn't safely capture attacker behavior like a honeypot."
    }
  },
  {
    "id": 58,
    "correctAnswer": "A",
    "studyGuideTopic": "Incident response lifecycle / Analysis",
    "explanation": "The correct answer is **A. Analysis**. In the analysis phase, responders investigate what happened, determine root cause, scope impact, identify IOCs, and understand the source and method of the incident.",
    "feedback": {
      "A": "Correct. Analysis focuses on understanding the incident details, including source and cause.",
      "B": "Lessons learned is post-incident review to improve processes and controls, after recovery.",
      "C": "Detection is discovering/alerting that an incident may be occurring; analysis comes after detection.",
      "D": "Containment focuses on stopping spread and limiting damage, not primarily discovering the source."
    }
  },
  {
    "id": 59,
    "correctAnswer": "C",
    "studyGuideTopic": "Vulnerability management / Validation",
    "explanation": "The correct answer is **C. Rescan the network**. After remediation, you validate that vulnerabilities are actually fixed by rescanning and confirming the findings are resolved.",
    "feedback": {
      "A": "An audit may be useful later, but the immediate next step after remediation is to validate the fix.",
      "B": "A penetration test is broader and more resource-intensive; rescanning is the standard validation step.",
      "C": "Correct. Rescanning verifies remediation and confirms vulnerabilities are no longer present.",
      "D": "Reporting is important, but it should be based on validated results after rescanning."
    }
  },
  {
    "id": 60,
    "correctAnswer": "B",
    "studyGuideTopic": "Insider risk / Data exfiltration indicators",
    "explanation": "The correct answer is **B. Insider threat**. An after-hours remote login followed by copying large amounts of data to a personal device is a strong indicator of malicious or negligent insider activity (often data theft/exfiltration).",
    "feedback": {
      "A": "Privilege escalation is gaining higher permissions than authorized; the scenario describes suspicious data copying behavior.",
      "B": "Correct. The user’s behavior fits insider threat indicators (unauthorized data copying/exfiltration).",
      "C": "Account takeover is possible, but nothing states the account was compromised; the best classification for the behavior is insider threat.",
      "D": "Data corruption is damaging/altering data; the scenario describes data copying, not corruption."
    }
  },
  {
    "id": 61,
    "correctAnswer": "B",
    "studyGuideTopic": "Web security / Secure web gateway",
    "explanation": "The correct answer is **B. Proxy**. Web proxies (secure web gateways) can enforce acceptable use, block categories/domains, inspect traffic, and log user web activity.",
    "feedback": {
      "A": "A firewall can block IPs/ports, but it is less effective for URL/category filtering and user-level web policy enforcement.",
      "B": "Correct. A proxy is designed to control and filter web access and can apply detailed browsing policies.",
      "C": "A WAF protects web applications from attacks (SQLi/XSS) and does not control employee browsing to external sites.",
      "D": "A load balancer distributes traffic across servers; it does not enforce web access policies for employees."
    }
  },
  {
    "id": 62,
    "correctAnswer": "A",
    "studyGuideTopic": "Wireless attacks / Deauthentication",
    "explanation": "The correct answer is **A. Dissociation attack**. A dissociation/deauthentication attack forces clients off the access point, often to capture handshakes or cause disruption.",
    "feedback": {
      "A": "Correct. Dissociation (deauth) attacks disconnect devices from an AP.",
      "B": "Evil twin is a fake AP that impersonates a legitimate network to lure users, not force disconnects directly.",
      "C": "Bluejacking is sending unsolicited messages via Bluetooth, unrelated to Wi‑Fi disconnections.",
      "D": "Replay attacks reuse captured authentication/traffic; they do not specifically force clients to disconnect."
    }
  },
  {
    "id": 63,
    "correctAnswer": "B",
    "studyGuideTopic": "Switch security / Port security",
    "explanation": "The correct answer is **B. Port security**. Port security restricts which devices (MAC addresses) can use a specific switch port and can shut down or restrict the port when an unauthorized device connects.",
    "feedback": {
      "A": "802.1X is port-based authentication, but the typical control described as restricting by physical port/device is switch port security.",
      "B": "Correct. Port security binds allowed MAC addresses/limits to a physical switch port.",
      "C": "A VPN secures remote connections over untrusted networks; it does not enforce access based on a physical switch port.",
      "D": "MAC filtering is often used on wireless or general access lists; port security is the switch-port-specific control."
    }
  },
  {
    "id": 64,
    "correctAnswer": "A",
    "studyGuideTopic": "Authentication protocols / Legacy risks",
    "explanation": "The correct answer is **A. PAP**. Password Authentication Protocol sends credentials without encryption (cleartext), making it insecure and unsuitable for modern use.",
    "feedback": {
      "A": "Correct. PAP transmits credentials in cleartext and is vulnerable to interception.",
      "B": "CHAP uses a challenge-response mechanism and does not send the password in cleartext.",
      "C": "EAP-TLS uses certificates for strong authentication and is secure when properly implemented.",
      "D": "PEAP tunnels EAP inside TLS, protecting credentials in transit."
    }
  },
  {
    "id": 65,
    "correctAnswer": "B",
    "studyGuideTopic": "Identity governance / Access reviews",
    "explanation": "The correct answer is **B. Account recertification**. Periodic access reviews and recertification ensure accounts are still required and properly authorized, reducing orphaned or unnecessary accounts.",
    "feedback": {
      "A": "RBAC helps structure permissions by role, but it doesn’t automatically remove accounts that are no longer needed.",
      "B": "Correct. Recertification/access reviews detect and remove orphaned or excessive access over time.",
      "C": "MFA strengthens authentication but does not prevent orphaned accounts from existing.",
      "D": "Hashing protects stored secrets (e.g., passwords) but does not manage account lifecycle."
    }
  },
  {
    "id": 66,
    "correctAnswer": "A",
    "studyGuideTopic": "Logging & auditing / Accountability",
    "explanation": "The correct answer is **A. Accountability**. Recording who performed an action, along with time and location, supports tracing actions to individuals for auditing and investigation.",
    "feedback": {
      "A": "Correct. Detailed logs create accountability by tying actions to specific users with context.",
      "B": "Confidentiality is preventing unauthorized disclosure; logging actions does not directly provide confidentiality.",
      "C": "Isolation separates systems or workloads; logs don’t enforce isolation.",
      "D": "Federation is sharing identity across systems; logging activity is not federation."
    }
  },
  {
    "id": 67,
    "correctAnswer": "C",
    "studyGuideTopic": "Password storage / Salting",
    "explanation": "The correct answer is **C. Rainbow table**. Without a unique salt, identical passwords produce identical hashes, enabling attackers to use precomputed rainbow tables to crack passwords efficiently.",
    "feedback": {
      "A": "The issue is not \"weak encryption\"—hashing without salt is still a hash, but it’s vulnerable to precomputed attacks.",
      "B": "Replay attacks reuse captured authentication tokens/traffic; they are unrelated to password hashing.",
      "C": "Correct. Unsalted hashes are susceptible to rainbow table and hash lookup attacks.",
      "D": "Session fixation targets web session IDs, not password hashing."
    }
  },
  {
    "id": 68,
    "correctAnswer": "C",
    "studyGuideTopic": "Compensating controls / Segmentation",
    "explanation": "The correct answer is **C. Network segmentation**. Segmentation is often used as a compensating control when a primary control cannot be implemented (e.g., isolating legacy systems that cannot be patched).",
    "feedback": {
      "A": "Physical locks are preventive physical controls, not typically described as compensating controls.",
      "B": "Encryption is a primary confidentiality control, not usually a compensating control by itself.",
      "C": "Correct. Segmentation commonly compensates for unpatchable/legacy systems by limiting exposure and blast radius.",
      "D": "MFA is a strong preventive control, but it is not typically categorized as a compensating control without specific context."
    }
  },
  {
    "id": 69,
    "correctAnswer": "B",
    "studyGuideTopic": "Social engineering / Messaging-based phishing",
    "explanation": "The correct answer is **B. Smishing**. Smishing is phishing delivered via SMS/text messages, often urging urgent account verification or payments.",
    "feedback": {
      "A": "Vishing is voice phishing over phone calls, not texts.",
      "B": "Correct. Smishing uses SMS texts to trick victims into revealing information or clicking malicious links.",
      "C": "Pretexting is creating a fabricated scenario to gain trust; it can be used within smishing, but the delivery method here is specifically text.",
      "D": "Whaling targets high-profile executives; this question focuses on the SMS delivery method."
    }
  },
  {
    "id": 70,
    "correctAnswer": "A",
    "studyGuideTopic": "Integrity verification / Software distribution",
    "explanation": "The correct answer is **A. Digital signature**. Digital signatures verify both integrity (no tampering) and authenticity (signed by the publisher) for downloaded software.",
    "feedback": {
      "A": "Correct. A valid signature proves the package wasn’t altered and came from the expected signer.",
      "B": "A TPM protects keys and supports attestation, but it doesn’t by itself verify a downloaded package’s integrity.",
      "C": "MFA protects logins; it does not validate file integrity.",
      "D": "A file share is a storage/location method; it does not ensure integrity."
    }
  },
  {
    "id": 71,
    "correctAnswer": "B",
    "studyGuideTopic": "Endpoint controls / Application control",
    "explanation": "The correct answer is **B. Application allow list**. Allow listing prevents installation/execution of unapproved applications by allowing only known-good software.",
    "feedback": {
      "A": "A deny list blocks known bad apps, but unknown or new malicious apps can still run if not listed.",
      "B": "Correct. Allow lists block everything except explicitly approved applications.",
      "C": "Host firewalls control traffic, not application approval for install/run.",
      "D": "A CASB governs cloud app usage and data; it’s not the primary tool for preventing local app installs."
    }
  },
  {
    "id": 72,
    "correctAnswer": "B",
    "studyGuideTopic": "Web threat prevention / DNS security",
    "explanation": "The correct answer is **B. DNS filtering**. DNS filtering blocks resolution to known malicious domains, preventing endpoints from reaching phishing and malware sites.",
    "feedback": {
      "A": "IDS detects suspicious traffic but does not prevent endpoints from reaching malicious domains.",
      "B": "Correct. DNS filtering stops domain resolution to known bad sites, preventing connections.",
      "C": "VLANs segment networks; they do not directly block specific malicious domains.",
      "D": "A SIEM correlates logs and alerts; it is not a prevention control for blocking domains."
    }
  },
  {
    "id": 73,
    "correctAnswer": "D",
    "studyGuideTopic": "Mobile security / BYOD risks",
    "explanation": "The correct answer is **D. Jailbreaking**. BYOD devices that are jailbroken/rooted bypass built-in OS security controls, increasing malware risk and weakening device integrity.",
    "feedback": {
      "A": "End of life is a risk for unsupported devices, but BYOD’s primary concern here is users modifying device security controls.",
      "B": "Buffer overflow is a software flaw; it is not a primary BYOD program concern as stated.",
      "C": "VM escape relates to virtualization, not typical BYOD mobile devices.",
      "D": "Correct. Jailbreaking/rooting undermines platform security and policy enforcement."
    }
  },
  {
    "id": 74,
    "correctAnswer": "C",
    "studyGuideTopic": "Quantitative risk / ARO",
    "explanation": "The correct answer is **C. ARO** (Annualized Rate of Occurrence). ARO estimates how often a specific event (like ransomware) is expected to occur in a year and is used in quantitative risk decisions, including insurance coverage choices.",
    "feedback": {
      "A": "MTTR measures mean time to repair/restore service; it’s not a risk frequency metric.",
      "B": "RTO is recovery time objective; it describes acceptable downtime, not incident likelihood.",
      "C": "Correct. ARO measures expected frequency per year and is used in quantitative risk calculations (e.g., ALE).",
      "D": "MTBF measures reliability time between failures; it’s not used to estimate cyber event frequency."
    }
  },
  {
    "id": 75,
    "correctAnswer": "A",
    "studyGuideTopic": "Security awareness / Phishing reporting",
    "explanation": "The correct answer is **A. Reporting phishing attempts**. Awareness messaging commonly focuses on recognizing and reporting phishing, suspicious links, and social engineering to reduce user-driven compromise.",
    "feedback": {
      "A": "Correct. User awareness programs emphasize spotting and reporting phishing/suspicious messages.",
      "B": "Detecting insider threats is typically a security operations function using monitoring and analytics, not a user awareness message.",
      "C": "Modifying wire transfer data is a fraud scenario (often BEC) and is not itself a recommended awareness communication item as written.",
      "D": "Third-party social engineering is a risk, but awareness messaging typically focuses on employee reporting/verification behaviors—phishing reporting is the best match."
    }
  },
  {
    "id": 78,
    "correctAnswer": "A",
    "studyGuideTopic": "Incident response / Preparation",
    "explanation": "The correct answer is **A. Preparation**. Preparation includes defining roles/responsibilities, training, playbooks, communication plans, and ensuring tools and access are ready before incidents occur.",
    "feedback": {
      "A": "Correct. Roles and responsibilities are defined and exercised during the preparation phase.",
      "B": "Recovery focuses on restoring services and returning systems to normal operations.",
      "C": "Lessons learned is the post-incident review to improve processes after recovery.",
      "D": "Analysis investigates what happened during the incident; roles should already be defined beforehand."
    }
  },
  {
    "id": 79,
    "correctAnswer": "D",
    "studyGuideTopic": "Network device hardening / Management interfaces",
    "explanation": "The correct answer is **D. Web-based administration**. Disabling unnecessary or risky management interfaces—especially web GUIs exposed to networks—reduces attack surface on routers and other infrastructure devices.",
    "feedback": {
      "A": "Console access is typically local and can be tightly controlled; disabling it can hinder recovery/maintenance.",
      "B": "Disabling routing protocols could break network functionality; the question is about hardening after a scan.",
      "C": "VLANs are segmentation mechanisms; disabling them is not a hardening action for routers.",
      "D": "Correct. Web-based administration increases attack surface; disable it when not required (or restrict/secure it)."
    }
  },
  {
    "id": 80,
    "correctAnswer": "D",
    "studyGuideTopic": "Integrity monitoring / File Integrity Monitoring (FIM)",
    "explanation": "The correct answer is **D. FIM**. File Integrity Monitoring tracks changes to critical files and configurations and can alert when unauthorized modifications occur—supporting integrity and change tracking.",
    "feedback": {
      "A": "SPF is an email anti-spoofing control; it does not track file changes.",
      "B": "GPO configures Windows policies, but it is not the control specifically designed to detect and track file changes.",
      "C": "NAC controls network access based on device posture; it doesn’t track file changes on endpoints by itself.",
      "D": "Correct. FIM detects and records changes to files/configs, supporting integrity monitoring."
    }
  },
  {
    "id": 81,
    "correctAnswer": "A",
    "studyGuideTopic": "Authentication attacks / Brute force",
    "explanation": "The correct answer is **A. Brute-force attack**. Repeated failed admin login attempts are a classic indicator of brute-force guessing (or password spraying depending on pattern). With repeated attempts against an admin account, brute force is the best match.",
    "feedback": {
      "A": "Correct. Many failed login attempts against an account commonly indicates brute-force password guessing.",
      "B": "Man-in-the-middle intercepts/relays traffic; failed logins alone don’t indicate MITM.",
      "C": "Replay attacks reuse captured valid authentication messages; they typically won’t show as repeated failed guesses.",
      "D": "Privilege escalation is obtaining higher permissions; repeated failed logins indicate attempted access, not escalated privileges."
    }
  },
  {
    "id": 82,
    "correctAnswer": "A",
    "studyGuideTopic": "Kiosk/locked-down systems / Application control",
    "explanation": "The correct answer is **A. Application allow list**. Kiosks should be locked down so only approved applications can run, preventing users or malware from executing unauthorized software.",
    "feedback": {
      "A": "Correct. Allow listing restricts execution to approved applications—ideal for kiosks.",
      "B": "FIM detects changes but does not prevent an unauthorized program from launching.",
      "C": "A network ACL controls traffic, not local application execution.",
      "D": "A VPN secures network traffic for remote access; it does not control what apps can run on a kiosk."
    }
  },
  {
    "id": 83,
    "correctAnswer": "B",
    "studyGuideTopic": "Phishing / Credential harvesting",
    "explanation": "The correct answer is **B. Phishing**. The user clicked a malicious link and submitted credentials to an attacker—classic credential-harvesting phishing.",
    "feedback": {
      "A": "A watering hole compromises a site users commonly visit; the scenario specifically describes a malicious link capturing credentials.",
      "B": "Correct. Phishing uses deceptive messages/links to trick users into revealing credentials.",
      "C": "Tailgating is physical social engineering (following someone into a secure area).",
      "D": "Vishing is voice phishing over phone calls, not link-based credential capture."
    }
  },
  {
    "id": 84,
    "correctAnswer": "C",
    "studyGuideTopic": "Endpoint security / EDR",
    "explanation": "The correct answer is **C. EDR** (Endpoint Detection and Response). EDR provides continuous endpoint monitoring, detection, and rapid response actions (isolation, kill process, quarantine) for real-time protection.",
    "feedback": {
      "A": "IDS monitors network/host activity for alerts, but it is not the typical tool for real-time endpoint protection and response.",
      "B": "IPS can block network attacks in transit, but it does not provide full endpoint telemetry and response.",
      "C": "Correct. EDR provides real-time endpoint monitoring and response capabilities.",
      "D": "A SIEM correlates logs centrally; it relies on sources like EDR but is not itself endpoint protection."
    }
  },
  {
    "id": 85,
    "correctAnswer": "A",
    "studyGuideTopic": "Social engineering / Voice phishing",
    "explanation": "The correct answer is **A. Vishing**. Vishing is phishing conducted over voice calls, persuading victims to reveal credentials or account details.",
    "feedback": {
      "A": "Correct. A phone call tricking a user into revealing account details is vishing.",
      "B": "Smishing is phishing via SMS/text, not phone calls.",
      "C": "Pretexting is using a fabricated story to gain trust; it can be used in vishing, but the best label here is vishing.",
      "D": "Pharming redirects users to fake sites via DNS/hosts manipulation; it’s not a phone-based scam."
    }
  },
  {
    "id": 86,
    "correctAnswer": "A",
    "studyGuideTopic": "Vulnerability assessment / Follow-up actions",
    "explanation": "The correct answer is **A. Manual review**. An inconclusive scan means the tool couldn’t determine the status reliably; the next step is to manually validate (check configs, versions, logs) or run targeted verification.",
    "feedback": {
      "A": "Correct. Manual validation/verification is appropriate when automated results are inconclusive.",
      "B": "A full penetration test is heavy-weight; you typically validate the specific finding first.",
      "C": "Patching immediately may cause outages and is inappropriate if you don’t know what’s actually vulnerable.",
      "D": "Ignoring inconclusive results can leave real vulnerabilities unaddressed."
    }
  },
  {
    "id": 87,
    "correctAnswer": "B",
    "studyGuideTopic": "High availability / Redundancy",
    "explanation": "The correct answer is **B. RAID**. RAID provides disk redundancy (and sometimes performance benefits), helping servers continue operating after a disk failure (depending on RAID level).",
    "feedback": {
      "A": "A UPS provides power backup, which improves availability, but the question asks specifically about redundancy for servers (commonly storage redundancy).",
      "B": "Correct. RAID provides redundancy for storage to tolerate disk failures.",
      "C": "VLANs segment networks; they do not provide hardware redundancy.",
      "D": "Hashing ensures integrity, not redundancy."
    }
  },
  {
    "id": 88,
    "correctAnswer": "A",
    "studyGuideTopic": "DNS security / Sinkholing",
    "explanation": "The correct answer is **A. DNS sinkholing**. Sinkholing redirects requests to known malicious domains to a controlled server or blocks them, preventing users from reaching malicious sites clicked from emails.",
    "feedback": {
      "A": "Correct. DNS sinkholing/blackholing blocks or redirects malicious domain lookups from email links.",
      "B": "Switch port security restricts devices on a switch port; it does not block malicious web destinations.",
      "C": "ARP inspection prevents ARP spoofing on a LAN; it’s unrelated to blocking malicious sites.",
      "D": "A WAF protects web applications you host; it does not stop users from browsing to external malicious domains."
    }
  },
  {
    "id": 89,
    "correctAnswer": "B",
    "studyGuideTopic": "Log management / Secure retention",
    "explanation": "The correct answer is **B. Encrypt and store offsite**. Regulatory log retention requires protecting confidentiality and integrity and ensuring availability, often via encrypted, write-protected, and offsite/immutable storage.",
    "feedback": {
      "A": "Plaintext storage increases risk of disclosure and tampering and is not appropriate for compliance retention.",
      "B": "Correct. Encrypting and storing logs offsite (ideally immutable/WORM) supports confidentiality and resilience.",
      "C": "Deleting logs after 30 days may violate retention requirements and removes forensic evidence.",
      "D": "Storing only locally increases risk of loss/tampering and is weaker for compliance and disaster recovery."
    }
  },
  {
    "id": 90,
    "correctAnswer": "A",
    "studyGuideTopic": "Malware prevention / Application control",
    "explanation": "The correct answer is **A. Allow list**. Allow listing prevents execution of unauthorized binaries/scripts on servers, which is one of the strongest controls against unknown malware execution.",
    "feedback": {
      "A": "Correct. Allow listing blocks unapproved executables, reducing malware execution risk on servers.",
      "B": "IDS detects suspicious activity but does not directly prevent execution on the server.",
      "C": "A reverse proxy protects web apps and can filter requests, but it won’t stop malware from executing on the server OS.",
      "D": "A SIEM collects/correlates logs; it is not an execution prevention mechanism."
    }
  },
  {
    "id": 91,
    "correctAnswer": "A",
    "studyGuideTopic": "Malware types / Trojans",
    "explanation": "The correct answer is **A. Trojan**. A trojan disguises itself as legitimate software to trick users into executing it (common via USB drives).",
    "feedback": {
      "A": "Correct. Trojans rely on user execution of a seemingly legitimate file.",
      "B": "A logic bomb is malicious code that triggers on a specific event/time; the scenario emphasizes user execution from USB.",
      "C": "Rootkits focus on stealth and privileged persistence; they may be delivered by a trojan, but the best match is trojan.",
      "D": "Supply chain attacks compromise software/hardware from a vendor; a USB file executed by a user is not supply chain."
    }
  },
  {
    "id": 92,
    "correctAnswer": "C",
    "studyGuideTopic": "Network security / Mutual authentication",
    "explanation": "The correct answer is **C. IPSec tunnel**. IPSec site-to-site (or host-to-host) tunnels use mutual authentication (certificates or pre-shared keys) so devices can verify the identity of the peer device.",
    "feedback": {
      "A": "Certificate pinning is an application/client technique to trust a specific server certificate; it’s not a general device-to-device network authentication solution.",
      "B": "802.1X authenticates endpoints to a network (port-based NAC). It’s not primarily used for device-to-device identity verification between network peers.",
      "C": "Correct. IPSec supports mutual authentication between peers, enabling devices to verify each other’s identity.",
      "D": "Federation is identity sharing between organizations/services (SSO). It does not authenticate network device peers."
    }
  },
  {
    "id": 93,
    "correctAnswer": "A",
    "studyGuideTopic": "Credential attacks / Password spraying",
    "explanation": "The correct answer is **A. Password spraying**. Password spraying uses a small set of common passwords across many accounts/systems, causing many failures across different systems without triggering lockouts quickly.",
    "feedback": {
      "A": "Correct. Many failed logins across multiple systems strongly suggests password spraying behavior.",
      "B": "DDoS targets availability by flooding resources; it’s not characterized by failed login attempts.",
      "C": "SQL injection targets web apps/databases via input fields; it doesn’t present as failed logins across many systems.",
      "D": "DNS poisoning redirects name resolution; it’s unrelated to login failure patterns."
    }
  },
  {
    "id": 94,
    "correctAnswer": "A",
    "studyGuideTopic": "Remote access hardening / Exposure reduction",
    "explanation": "The correct answer is **A. Disable RDP** (or otherwise remove external exposure). If RDP is unnecessarily exposed, the first action is to eliminate or restrict it to reduce immediate attack surface and prevent brute-force compromise.",
    "feedback": {
      "A": "Correct. Removing/closing exposed RDP is the fastest way to reduce immediate risk (then replace with safer access methods).",
      "B": "MFA is excellent, but it still leaves the service exposed; disabling/restricting exposure is typically the first containment step.",
      "C": "RDP traffic is already encrypted in modern deployments; encryption alone doesn’t address exposure and brute-force attempts.",
      "D": "Changing passwords helps, but exposed RDP can still be attacked; reducing exposure is the priority first action."
    }
  },
  {
    "id": 95,
    "correctAnswer": "B",
    "studyGuideTopic": "Web application attacks / SQL injection",
    "explanation": "The correct answer is **B. SQL injection**. SQL injection exploits improper input handling to manipulate database queries, often enabled by misconfigurations and weak parameterization/validation.",
    "feedback": {
      "A": "Buffer overflow is a memory corruption issue, not a database query manipulation attack.",
      "B": "Correct. SQL injection targets databases through improperly handled input and query construction.",
      "C": "VM escape is breaking out of a virtual machine into the host; it’s unrelated to databases.",
      "D": "Memory injection is process/memory manipulation, not specifically a database misconfiguration exploitation method."
    }
  },
  {
    "id": 96,
    "correctAnswer": "A",
    "studyGuideTopic": "PKI / Certificate status validation",
    "explanation": "The correct answer is **A. OCSP**. Online Certificate Status Protocol checks whether a certificate is valid/revoked at the time it’s presented.",
    "feedback": {
      "A": "Correct. OCSP provides real-time certificate revocation/status checking.",
      "B": "A CSR (Certificate Signing Request) is used to request a new certificate from a CA, not validate one during use.",
      "C": "A CA issues certificates; it doesn’t provide the specific protocol for real-time status checks in this answer set.",
      "D": "CRC is an error-detection method for data integrity, not a certificate validation mechanism."
    }
  },
  {
    "id": 97,
    "correctAnswer": "B",
    "studyGuideTopic": "Firmware security / BIOS/UEFI",
    "explanation": "The correct answer is **B. Firmware**. BIOS/UEFI updates address firmware vulnerabilities that can affect boot process integrity and hardware-level security.",
    "feedback": {
      "A": "Virtualization vulnerabilities relate to hypervisors/VMs, not BIOS updates.",
      "B": "Correct. BIOS/UEFI is firmware; updating it remediates firmware vulnerabilities.",
      "C": "Application vulnerabilities are patched by updating the application, not the BIOS.",
      "D": "Operating system vulnerabilities are addressed with OS patches, not BIOS updates."
    }
  },
  {
    "id": 98,
    "correctAnswer": "B",
    "studyGuideTopic": "Vulnerability scoring / CVSS",
    "explanation": "The correct answer is **B. CVSS**. CVSS provides a numerical score representing vulnerability severity/criticality, helping prioritize remediation.",
    "feedback": {
      "A": "CVE is an identifier for vulnerabilities, not a quantitative severity score.",
      "B": "Correct. CVSS provides a numeric score used for prioritization.",
      "C": "CIA is the security triad (confidentiality, integrity, availability), not a scoring system.",
      "D": "CERT is an organization/term related to incident response advisories; it’s not a vulnerability scoring system."
    }
  },
  {
    "id": 99,
    "correctAnswer": "D",
    "studyGuideTopic": "Endpoint management / Configuration monitoring",
    "explanation": "The correct answer is **D. Install endpoint management**. Endpoint management platforms (MDM/UEM/endpoint management suites) provide centralized monitoring and control, including detecting unauthorized configuration or software changes across servers and workstations.",
    "feedback": {
      "A": "Logging scheduled tasks is a narrow control and won’t comprehensively detect unauthorized changes across endpoints.",
      "B": "Outbound traffic monitoring focuses on network behavior, not configuration/file change monitoring on endpoints.",
      "C": "Signature blocking can stop known malware, but it doesn’t ensure monitoring for unauthorized configuration changes.",
      "D": "Correct. Endpoint management enables centralized monitoring/compliance and can detect/report unauthorized changes."
    }
  },
  {
    "id": 100,
    "correctAnswer": "B",
    "studyGuideTopic": "VPNs / Data in transit protection",
    "explanation": "The correct answer is **B. Data in transit**. A VPN encrypts traffic between sites so data traveling across untrusted networks cannot be intercepted or modified easily.",
    "feedback": {
      "A": "Data in use is data being processed in memory/CPU; VPNs do not protect data while it’s being used.",
      "B": "Correct. VPNs protect data in transit by encrypting and authenticating network communications.",
      "C": "Geographic restrictions (geo-blocking) are policy controls; VPNs do not inherently enforce geography.",
      "D": "Data sovereignty concerns legal jurisdiction and where data is stored; VPNs address transit security, not jurisdiction."
    }
  }
]
